app/Http/Controllers/CartController.php

select * from `categories` where `categories`.`id` = 91 and `categories`.`deleted_at` is null limit 1
---
    public function add(Request $request)
    {
        if(isset($request->session_id)){
            $this->setSessionID($request->session_id);
        }

        $item = Items::find($request->id);
        $restID = $item->category->restorant->id;

        $restaurant = Restorant::findOrFail($restID);