app/Http/Controllers/FrontEndController.php

select * from `banners`
---
            if($demoVendor){
                $demoLink=$demoVendor->getLinkAttribute();
            }
 $banners_data = Banners::all();

select * from `pages` where `showAsLink` = 1
---
                'availableLanguages' => $availableLanguages,
                'demoLink'=>$demoLink,
                'locale' => $locale,
                'pages' => Pages::where('showAsLink', 1)->get(),

select * from `cities` where `id` > 0 and `cities`.`deleted_at` is null
---
                'processes' => $processes,
                'featured_vendors'=>$featured_vendors,
                'restorant' => $restorant,
                'sections' =>[['super_title'=>__('Cities'), 'title'=>__('Find us in these cities and many more!'), 'cities'=>City::where('id', '>', 0)->get()]],

select * from `tables` where `restaurant_id` = 19
---
            $previousOrderArray = array_filter(explode(',', $previousOrders));

            //tables
            $tables = Tables::where('restaurant_id', $restorant->id)->get();