app/Http/Controllers/RestorantController.php

select * from `localmenus` where `localmenus`.`restaurant_id` = 17 and `localmenus`.`restaurant_id` is not null
---
    public function edit(Restorant $restaurant)
    {

        //Days of the week
        $timestamp = strtotime('next Monday');
        for ($i = 0; $i < 7; $i++) {
            $days[] = strftime('%A', $timestamp);
            $timestamp = strtotime('+1 day', $timestamp);
        }

        //Generate days columns
        $hoursRange = ['id'];
        for ($i = 0; $i < 7; $i++) {
            $from = $i.'_from';
            $to = $i.'_to';

            array_push($hoursRange, $from);
            array_push($hoursRange, $to);
        }





        //Languages
        $available_languages=[];
        $default_language=null;

        try {
            if($restaurant->localMenus()->get()){
                $available_languages=$restaurant->localMenus()->get()->pluck('languageName','id');
                foreach ($restaurant->localMenus()->get() as $key => $localMenu) {

delete from `hours` where `id` = 22
---
    public function workingHoursremove(Hours $hours){
        if (!auth()->user()->hasRole('admin')) {
            if (auth()->user()->hasRole('owner')&&$hours->restorant->user->id==auth()->user()->id) {
                //ok, owner
            }else{
                abort(404);
            }

        }


        $hours->delete();

select * from `hours` where (`id` = '22') limit 1
update `hours` set `0_from` = '11:00 PM', `0_to` = '1:00 AM', `1_from` = '11:00 PM', `1_to` = '1:00 AM', `2_from` = '11:00 PM', `2_to` = '1:00 AM', `3_from` = '11:00 PM', `3_to` = '1:00 AM', `hours`.`updated_at` = '2022-07-08 20:41:13' where `id` = 22
---
    public function workingHours(Request $request)
    {
        $hours = Hours::where(['id' => $request->shift_id])->first();

        $shift="_shift".$request->shift_id;

        $hours->{'0_from'} = $request->{'0_from'.$shift} ?? null;
        $hours->{'0_to'} = $request->{'0_to'.$shift} ?? null;
        $hours->{'1_from'} = $request->{'1_from'.$shift} ?? null;
        $hours->{'1_to'} = $request->{'1_to'.$shift} ?? null;
        $hours->{'2_from'} = $request->{'2_from'.$shift} ?? null;
        $hours->{'2_to'} = $request->{'2_to'.$shift} ?? null;
        $hours->{'3_from'} = $request->{'3_from'.$shift} ?? null;
        $hours->{'3_to'} = $request->{'3_to'.$shift} ?? null;
        $hours->{'4_from'} = $request->{'4_from'.$shift} ?? null;
        $hours->{'4_to'} = $request->{'4_to'.$shift} ?? null;
        $hours->{'5_from'} = $request->{'5_from'.$shift} ?? null;
        $hours->{'5_to'} = $request->{'5_to'.$shift} ?? null;
        $hours->{'6_from'} = $request->{'6_from'.$shift} ?? null;
        $hours->{'6_to'} = $request->{'6_to'.$shift} ?? null;
        $hours->update();